- What is a Dataframe (DF) - (Pandas)
- Create DF
- Vectorized Operations
- Access rows, columns, cells, (.loc, .iloc, .at)
- Change Values
- Sort Values

### note:  .loc = label and .iloc = positions (numbers)

In [33]:
import pandas as pd ## pandas and a data frame is a data series is just its own collection of values

In [34]:
from typing import List
data_list: list[int]= [1,2,3,4,5]


s1 = pd.Series(data_list)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [35]:
s1 = s1+23
s1

0    24
1    25
2    26
3    27
4    28
dtype: int64

In [36]:
## data frame = a collection of series objects
## DF Rules: Columns must be homogenous. All columns must have same numbers of data entries.
## to create a DF: 

# Dictionary creation:
data = {
    "name": ["Nate","Rebecca","Edwin","Preston"],
    "age" : [39,40,11,7],
    "year": ["Senior", "Junior", "Sophmore", "Freshman"]
}
students_df = pd.DataFrame(data=data)
students_df = students_df.set_index("name")
students_df

         age      year
name
Nate      39    Senior
Rebecca   40    Junior
Edwin     11  Sophmore
Preston    7  Freshman

In [37]:
students_df = students_df.reset_index()
students_df

      name  age      year
0     Nate   39    Senior
1  Rebecca   40    Junior
2    Edwin   11  Sophmore
3  Preston    7  Freshman

In [38]:
# Row-Based creation:
import random

name = ["Messi", "Ronaldo", "Neymar", "Pulisc", "Mbappe"]
goals_per_game = [random.random() for _ in name ]
games = [round(random.random()* 1000) for _ in name ]

cols = ["name", "goals/game", "games"]
stats = [[name[i], goals_per_game[i], games[i]]for i in range(5)]
stats_df = pd.DataFrame(data = stats, columns = cols)
stats_df

      name  goals/game  games
0    Messi    0.273383    797
1  Ronaldo    0.169040    288
2   Neymar    0.385260    488
3   Pulisc    0.613721    789
4   Mbappe    0.190771    826

In [39]:
stats_df["new_col"] = 0
stats_df

      name  goals/game  games  new_col
0    Messi    0.273383    797        0
1  Ronaldo    0.169040    288        0
2   Neymar    0.385260    488        0
3   Pulisc    0.613721    789        0
4   Mbappe    0.190771    826        0

In [40]:
stats_df = stats_df.drop(columns= ["new_col"])
stats_df

      name  goals/game  games
0    Messi    0.273383    797
1  Ronaldo    0.169040    288
2   Neymar    0.385260    488
3   Pulisc    0.613721    789
4   Mbappe    0.190771    826

In [41]:
stats_df['goals'] = stats_df ['goals/game'] * stats_df ["games"]
stats_df

      name  goals/game  games       goals
0    Messi    0.273383    797  217.886195
1  Ronaldo    0.169040    288   48.683589
2   Neymar    0.385260    488  188.006835
3   Pulisc    0.613721    789  484.225737
4   Mbappe    0.190771    826  157.577201

In [42]:
# stats_df = stats_df.rename (columns = {"goals/game": "goals_p_game"})
stats_df= stats_df.rename(columns={"goals/game": "goals_p_game"})
stats_df

      name  goals_p_game  games       goals
0    Messi      0.273383    797  217.886195
1  Ronaldo      0.169040    288   48.683589
2   Neymar      0.385260    488  188.006835
3   Pulisc      0.613721    789  484.225737
4   Mbappe      0.190771    826  157.577201

In [43]:
stats_df["name"] = stats_df ["name"].str.lower()
stats_df

      name  goals_p_game  games       goals
0    messi      0.273383    797  217.886195
1  ronaldo      0.169040    288   48.683589
2   neymar      0.385260    488  188.006835
3   pulisc      0.613721    789  484.225737
4   mbappe      0.190771    826  157.577201

In [44]:
## filtering with .loc

stats_df.loc[0]

name                 messi
goals_p_game      0.273383
games                  797
goals           217.886195
Name: 0, dtype: object

In [45]:
stats_df.loc[0,"name"]

'messi'

In [46]:
stats_df.loc[0]

name                 messi
goals_p_game      0.273383
games                  797
goals           217.886195
Name: 0, dtype: object

In [47]:
stats_df.loc[:,"name"]

0      messi
1    ronaldo
2     neymar
3     pulisc
4     mbappe
Name: name, dtype: object

In [48]:
# in df, second item after colon is inclusive
stats_df.loc[1:2,"name"]

1    ronaldo
2     neymar
Name: name, dtype: object

In [49]:
l = [1,2,3,4,5]
l[1:2] # in a list the second item is exclusive

[2]

In [50]:
stats_df.loc[:,"name":"goals"]

      name  goals_p_game  games       goals
0    messi      0.273383    797  217.886195
1  ronaldo      0.169040    288   48.683589
2   neymar      0.385260    488  188.006835
3   pulisc      0.613721    789  484.225737
4   mbappe      0.190771    826  157.577201

In [53]:
# boolean logic with .loc
stats_df.loc[stats_df["goals_p_game"]>0.5]

     name  goals_p_game  games       goals
3  pulisc      0.613721    789  484.225737

In [52]:
stats_df.loc[stats_df["goals_p_game"]> 0.5, "name"]

3    pulisc
Name: name, dtype: object

In [54]:
stats_df.loc[stats_df["name"]== "messi", "name"]= "ronaldo"
stats_df.loc[stats_df["goals_p_game"]> 0.5,"name"] = "messi"
stats_df

      name  goals_p_game  games       goals
0  ronaldo      0.273383    797  217.886195
1  ronaldo      0.169040    288   48.683589
2   neymar      0.385260    488  188.006835
3    messi      0.613721    789  484.225737
4   mbappe      0.190771    826  157.577201

In [ ]:
## left off at .iloc, .at, .iat